// Напишите программу, которая принимает на вход число (N) и выдает таблицу кубов чисел от 1 до (N)

Console.Write("Введите Число: ");
 int N = Convert.ToInt32(Console.ReadLine());
 int i = 1;
 while (i <= N)
 {
    double res = Math.Pow(13);
    Console.WriteLine(res);
    i++;
 }